<template>
  <div class="service-wrap">
    <div class="service-content">
      <h3>尊敬的用户：</h3>
      <p>非常感谢您注册使用乐心课程付费会员产品，为让您更好地使用乐心运动提供的产品和服务，请您务必审慎阅读、充分理解《乐心付费会员用户协议》（以下称“用户协议”或“本协议”）各条款内容，特别是免除或者限制责任的条款，并选择接受或不接受。本协议中限制、免责条款可能以加粗形式提醒您注意。</p>
      <p>除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用乐心运动提供相关产品和服务。您的下载、安装、使用、登陆等行为即视为您已阅读并同意本协议的约束。</p>
      <h3>一、协议的范围 </h3>
      <p>1、乐心课程是由广州动心信息科技有限公司（以下称“乐心运动”或“我们”）提供的互联网产品和服务，其载体包含：乐心运动APP、乐心运动小程序、乐心运动微信公众号、乐心健康微信公众号等。</p>
      <p>2、本用户协议是用户（您）与乐心运动之间关于使用乐心课程付费会员的产品和服务所订立的协议，本协议条款的效力及于乐心运动所提供的付费会员的一切产品和服务，用户在享受乐心运动任何单项产品或服务时，应当受本协议的约束。</p>
      <p>3、本协议项下的付费会员产品和服务是指由乐心运动发布的包括但不限于网络媒体、互联网增值、互动娱乐、电子商务和广告等的互联网产品和服务（形式包括但不限于在线视频、图片、软件、技术代码等）。 </p>
      <p>4、本协议内容同时包括所有乐心运动已经发布或未来可能发布的各类规则、公告或通知，且您在使用乐心课程某一特定产品或服务时，可能会另有单独的协议、相关服务规则等，前述规则、公告、通知和协议一经发布即为本协议不可分割的组成部分，您同样应当遵守。如您不同意本协议的约定，您应立即停止注册/激活并停止使用乐心运动的相关产品和服务。</p>
      <p>5、乐心运动有权根据需要不时地修订本协议及/或各类规则（包括但不限于制定新的条款和修改既有条款），并以在线公告的方式进行变更公告，无须另行单独通知您。对于重大变更，我们会向您发出郑重通知（包括对于某些服务，我们会通过电子邮件发送通知，说明对隐私政策进行的更改）。修订后的协议和规则一经公布，立即或在公告明确的特定时间自动生效。若您在前述公告修订后继续使用乐心运动的产品或服务，即视为您已阅读、理解并接受经过修订的协议和规则。若您不同意修订，应当立即停止使用乐心运动提供的产品和服务。</p>
      <p>6、除本协议明确规定外，对于利用乐心运动开发/发布的产品和服务，我们有权在本协议的基础上通过单独的产品和服务协议（以下称“单项产品协议”）加以规范，用户须在使用有关产品或服务时另行了解与确认。单项产品协议与本协议有冲突的地方，以单项产品协议为准。如用户使用该产品或服务，即视为对相关单项产品协议的接受。 </p>
      <h3>二、乐心课程付费会员产品及服务简介</h3>
      <p>1、乐心运动为使用乐心课程的付费会员用户提供多样的互联网产品和服务，包括但不限于课程、电商、社区等相关产品，用户可以通过乐心运动产品使用、分享、购买乐心运动提供的产品和服务。用户有权获得乐心运动提供的产品和服务，但乐心运动有权收取由此产生的服务或产品费用。 </p>
      <p>2、乐心运动运营者将尽力提供畅通无阻的在线服务，但平台的网络接入服务可能受多种因素的影响出现链接受阻、受限或被终止，由此给您带来的损失、不便，我们将不负任何责任。 </p>
      <p>3、乐心运动提供的部分产品和服务须付费使用，用户使用此类产品需要向乐心运动运营者支付一定的费用。对于收费的产品和服务，我们会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用/继续使用该等收费产品和服务。如用户拒绝支付相关费用，则乐心运动运营者有权不向用户提供该等收费产品和服务。 </p>
      <p>4、乐心运动仅提供在线产品和服务，除此之外与网络服务有关的设备（如手机、个人电脑、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。 </p>
      <h3>三、付费会员服务和账号查询</h3>
      <p>1、一旦您成为乐心付费会员，该项服务即时生效。</p>
      <p>2、付费会员的增值服务资费标准以乐心运动系列平台上标注的详细资费标价为准，我们有权基于自身业务发展需要变更上述资费标准，但会根据实际运营情况对不同阶段已经激活且持续有效的付费会员给予续费、升级方面的不同资费优惠，具体优惠政策以乐心运动在相关服务页面公告的内容为准。 </p>
      <p class='red'>3、您可以通过登录乐心运动付费会员中心免费查询您的账号信息详情，包括已开通的服务内容、服务期限、消费金额、交易状态等。</p>
      <h3>四、付费会员权限及服务期限</h3>
      <p>1、您的观看服务周期不会因其在观看期间对节目的中断、终止、倒回等情况而延长。</p>
      <p>2、付费会员服务提供的视频都有固定的观看服务期限，您一旦成为付费会员即视为认可它的观看服务期限。</p>
      <p>3、您在购买乐心运动付费会员后可享受的全部权益以乐心运动公布的付费会员权益为准，我们有权基于自身业务发展需要变更全部或部分会员权益。就前述权益调整乐心运动将在相应服务页面进行通知或公告，您也可查询最新的付费会员权益内容。</p>
      <h3>五、付费会员的权利及限制</h3>
      <p>1、付费会员服务仅限于申请账号个人使用，不得用于商业等用途；会员服务期内不能在帐号之间转移，不得赠与、借用、作用、转让或售卖。</p>
      <p class="red">2、同一付费会员账号只允许在最多二个设备上使用，且同一时间同一账号仅可在2个设备上登录观影，您须自行承担超范围使用而导致的任何后果。</p>
      <p>3、付费会员不得以盗窃、利用系统漏洞等非法途径以及在未获乐心授权的非法销售乐心会员的网站上获取或购买会员服务。 </p>
      <p>4、除非乐心提前书面许可，禁止复制、下载、上传、修改、编目排序、翻译、发行、开发、转让、销售、展示、传播会员服务提供的视频；禁止合成、嵌套、链接会员服务提供的视频；禁止利用会员服务提供的视频及其片段进行创作衍生作品、制作贺卡、制作屏保或桌面、进行教学或研究、进行商业开发或推广；禁止以商业目的使用会员服务提供的视频；包括但不限于下列情况：</p>
      <p>（1）通过非法手段对付费会员账户的服务期限、消费金额、交易状态进行修改，或用非法的方式或为了非法的目的使用已购买的会员服务提供的视频； </p>
      <p>（2）将您的付费会员账户有偿或无偿提供给任何第三人，并允许他人通过您的账户观看非他人付费购买的会员服务提供的视频。</p>
      <p>（3）将会员服务提供的视频复制、销售、出租或授权给任何第三方。</p>
      <p>（4）主动用于保护会员服务提供的视频的任何安全措施技术进行破解、更改、反操作、破坏或其他篡改，或协助他人进行上述行为。</p>
      <p>（5）通过非乐心认可的方式获得会员服务提供的视频，或者删除会员服务提供的视频上的任何所有权声明或标签。</p>
      <p>（6）不会采用收费或免费的方式，全部或部分在任何公开场合展示会员服务提供的视频，除非您的上述行为不会构成侵权。</p>
      <p>（7）损害第三方利益，通过乐心收集第三方资料信息，破坏或盗取第三方账号，发送诈骗邮件和垃圾邮件等非法信息，侵犯第三方合法权益，包括但不限于隐私权、知识产权、财产权等。 </p>
      <h3>六、乐心课程的替换、修改和升级 </h3>
      <p>1、为增进用户体验、完善服务内容，乐心有权根据您对软件的使用状态和行为开发新的服务；</p>
      <p>2、为改进、增强和进一步开发服务，乐心有权不时提供软件更新（包括软件升级替换、修改、功能强化、版本升级等形式）； </p>
      <p>3、用户理解并同意：乐心有权不向您特别通知而对APP进行更新，或对部分功能进行改变或限制；</p>
      <p>4、乐心运动新版本发布后，旧版本可能无法使用。乐心运营者不保证旧版及相应的服务继续可用。为充分、及时使用乐心运动APP的服务，请您随时核对并下载最新版本。 </p>
      <h3>七、第三方应用及服务</h3>
      <p>乐心产品中提供了支持第三方应用供用户使用的功能模块，包括但不限于工具类服务、视频或图片类服务等，以及今后可能出现的各种服务。用户在使用该类应用程序时，应遵守本协议及该应用程序相应的协议、条款或规则的规定。用户与开发者之间的权利义务，参照相关协议、条款或规则执行。用户在使用第三方提供的软件和服务时，须了解并同意：</p>
      <p>1、用户使用第三方开发者提供的应用与服务时，第三方开发者将根据用户授权获得用户的个人资料和内容信息。这些资料和信息由用户自行决定授权给第三方。用户须明确：将个人资料和内容信息向第三方开发者提供后可能发生的信息泄露问题，乐心运营者对此不承担责任。 </p>
      <p>2、乐心对第三方开发者提供的应用享有审核管理权，有权在不通知用户的情况下，对第三方应用进行下架处理，由此给用户带来的影响、损失，乐心运营者将不承担责任，由用户自行承担或与第三方协商，但乐心将尽力保障用户权益不受侵犯。</p>
      <p>3、用户使用第三方应用时，须同意：（1）授权使用自己的乐心运动会员账号登陆第三方应用；（2）同意第三方应用获取自己的个人资料，以获得相应产品和服务。</p>
      <p>4、用户因使用第三方应用而与该第三方开发者产生的任何纠纷，由用户与开发者自行协商解决，相关责任和赔偿由开发者单独承担，乐心运营者不承担任何责任。</p>
      <h3>八、知识产权声明 </h3>
      <p class='red'>1、乐心运动依法享有自身产品的一切合法权属（包括但不限于知识产权及所有权）。乐心运动的全部著作权及其他一切知识产权，以及相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图标、色彩组合、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中国知识产权相关法律法规和有关的国际条约的保护。 </p>
      <p>2、乐心运动产品及通过乐心运动产品提供的视频、游戏、技术软件等产品和信息，除用户自己上传或明确标示由第三方提供的之外，全部权利归属于乐心运动。 </p>
      <p>3、乐心运动产品中所体现的服务标识均属于乐心在中国或其他国家、地区的商标或者注册商标，用户未经合法授权不得自行使用。</p>
      <p>4、乐心运动在涉及乐心产品及相关各项服务中拥有专利权、专利申请权、商标权、著作权及其他知识产权。乐心运动并未因为本协议或者因为向用户提供相关产品和服务而授予用户任何相关的知识产权。本协议未明确授予用户的权利均由乐心运动保留。</p>
      <h3>九、用户隐私制度 </h3>
      <p>1、保护用户个人信息是乐心运动的一项基本原则。乐心运动将按照本协议及《隐私政策》的规定收集、使用、储存和分享您的个人信息。本协议对个人信息的保护规定与《隐私政策》有相冲突的，及本协议对个人信息保护相关内容未作明确规定的，均应以《隐私政策》的内容为准。</p>
      <p>2、您在注册账号或使用乐心运动产品和服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，可能无法使用产品或服务，或在使用过程中受到限制。</p>
      <p>3、我们承诺 </p>
      <p>a.我们不会根据敏感类别（例如种族、宗教、性取向或健康状况）向您展示个性化广告</p>
      <p>b.我们不会与广告主分享可用于识别您个人身份的信息，例如您的姓名或电子邮件地址（除非经您授权同意） </p>
      <p>c.在任何时候、任何情况下都不会向任何第三方出售您的个人信息，我们只会在法律允许的范围内使用根据本协议获得的信息。我们会制定严格的政策保护您的个人信息，除非事先获得您的授权或本声明另有规定之外，不会将您的这些信息对外公开或向第三方提供。</p>
      <p>d.为方便您的访问并丰富您的体验，我们可能会由关联公司或其他可信合作单位向您提供产品或服务。您可以选择是否访问这类内容或链接，或是否使用该第三方的产品或服务。但我们无法控制第三方掌握的您的任何个人信息。您在使用第三方产品或服务过程中的信息保护问题，不适用于本协议。本协议也不适用于您自行选择提供给第三方的任何信息。请您查看该第三方的隐私保护政策。</p>
      <p>e.您可以随时浏览、修改、删除、导出自己提交的信息，具体请参考《隐私政策》。 </p>
      <p>f.未经您的授权，乐心运动不会将您的个人信息转移或披露给任何非关联的第三方，除非： </p>
      <p>g.相关法律法规或法院、政府机关要求； 为完成合并、分立、收购或资产转让而转移； 为提供您要求的服务所必须； 必要且不违反法律、法规强制性规定的其他情形。</p>
      <p>h.乐心运动非常重视对未成年人信息的保护。若您是18周岁以下的未成年人，在使用乐心的服务前，应事先取得您的法定监护人的同意。 </p>
      <h3>十、账号、密码和安全性 </h3>
      <p>1、在您完成注册程序或以其他乐心运动允许的方式实际使用乐心运动提供的付费会员产品和服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且乐心运动有权注销或永久冻结您的账户，并保留向您或您的监护人索取赔偿的权利。</p>
      <p>2、18周岁以下的未成年人等非完全民事行为能力人应该在法定监护人的指导下使用乐心运动的产品和服务。 </p>
      <p>3、为完整使用乐心运动提供的付费会员产品和服务，您须购买付费会员服务。您也可通过各种已有和未来新增的渠道成为付费会员，包括但不限于：通过网银支付、手机支付或第三方支付等方式成为付费会员。在使用具体某种方式成为会员时，您须阅读并确认接受相关的服务条款和使用方法。您在购买乐心UI买的付费会员服务时须对所提供信息的真实性、合法性、有效性及完整性负责，并及时维护和更新您的个人信息，以保证信息的真实、合法和有效。</p>
      <p>4、乐心运动在此特别提醒您务必保护好您的账号及密码，切勿将账号及密码透露给他人。您须自行负责对您的账户和密码进行保密，且须对在您的账户和密码下发生的所有活动（包括但不限于信息披露、信息发布、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。</p>
      <p>5、您可以对账户设置昵称，您设置的昵称不得侵犯或涉嫌侵犯他人的合法权益。用户承诺设置昵称时遵守以下规定：</p>
      <p>a.不以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；</p>
      <p>b.不以国家机构或其他机构的名称注册；</p>
      <p>c.不注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的账号；</p>
      <p>d.不注册易产生歧义、引起他人误解或其它不符合法律规定的账号。</p>
      <p>e.如您设置的昵称涉嫌侵犯他人合法权益，乐心运动有权终止向您提供部分或全部软件服务。并对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。</p>
      <h3>十一、用户同意授权乐心运营者基于下列原因使用用户的信息资源： </h3>
      <p>1、执行软件验证、升级服务；</p>
      <p>2、提高用户的使用安全性或提供客户支持；</p>
      <p>3、应用户特殊要求而提供特定服务时，需要将信息提供给乐心运动或与此相关联的第三方或其他用户；</p>
      <p>4、将各种非个人隐私数据用于商业目的，包括但不限于向第三方提供增值服务、广告、定位广告、营销、联合注册、促销或其他活动等；</p>
      <p>5、应司法机关或政府机关要求；</p>
      <p>6、为提高用户使用体验；</p>
      <p>7、其他有利于用户利益且不违反任何强制性法律法规的情况。</p>
      <h3>十二、产品/服务的变更、中止或结束</h3>
      <p>1、用户应规范、合法地使用乐心运动及服务，如用户发布违法、违背社会公德或违背本协议约定的信息，或有违反相关法律法规或本协议的行为，我们有权采取以下措施：</p>
      <p>a.直接删除违反法律法规或本协议的内容； </p>
      <p>b.中止或限制您使用乐心运动及其产品和服务的权利，包括但不限于限制您使用乐心运动部分或全部功能及产品、服务等； </p>
      <p>c.终止您使用乐心运动的权利； </p>
      <p>d.回收您的账号，同时有权禁止您申请或通过其他方式取得新的账号； </p>
      <p>e.依法追究您的法律责任，索取相应损害赔偿金。 </p>
      <p>f.乐心运动有权根据业务发展需要中止、变更、终止其产品或其部分功能，并有权决定是否（继续）提供某种产品和服务；对于前述情形，并不负有向用户通知的义务。</p>
      <p>2、除法律另有规定外，用户有责任自行备份存储在乐心运动的数据，如用户的服务被终止，乐心运营者有权从服务器上永久地删除您在乐心运动的全部相关数据，并不负有向您返还或以任何形式提供前述数据的义务。</p>
      <p>3、适用法律及争议解决方式 </p>
      <p>a.本协议签订地为中华人民共和国广东省深圳市。</p>
      <p>b.本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
      <p>c.若您与乐心运动运营者发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交至北京仲裁委员会在北京仲裁解决。仲裁裁决是终局的，对双方均有约束力。 </p>
      <h3>十三、其他规定</h3>
      <p>1、如本协议中的任何条款因任何原因部分无效或不具有执行力，不影响本协议中其余条款对双方的约束力</p>
      <p>2、本协议条款的标题仅为方便阅读而设，不作为解释本协议条款的依据。</p>
   </div>
  </div>
</template>
<script>
import { navTitleBridge, LSJavascriptBridgeInit } from "@/util/jsBridge";

export default {
  mounted() {
    LSJavascriptBridgeInit(() => {
      navTitleBridge({
        title: "乐心课程付费会员用户协议",
        autoTopPadding: true,
        tintColorType: 2,
        backButtonType: 1,
        barLineHidden: false,
        color: { red: 255, green: 255, blue: 255, alpha: 255 }
      });
    });
  }
};
</script>

<style lang="less">
.service-wrap {
  width: 100%;
  min-height: 100vh;
  background: #f1f2f7;
  overflow: hidden;
  .service-content {
    background: #fff;
    padding: 60px 30px;
    margin-top: 20px;
    .title {
      font-size: 32px;
      color: #414141;
    }
    p {
      font-size: 28px;
      color: #b6b6b6;
      margin-top: 20px;
      &.red{
        color: #f00
      }
    }
    h3{
      font-size: 32px;
      color: #555;
      &:not(:first-child){
        margin-top: 30px;
      }
    }
  }
}
</style>